soap-builder/src/test/resources/services/test07/operations/TestServiceSoap/GetChildren.request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://schemas.eviware.com/TestService/v1/">
   <soapenv:Header>
      <v1:SignatureHeader>
         <!--Optional:-->
         <v1:CheckSum>?</v1:CheckSum>
         <!--Optional:-->
         <v1:RemoteSite>?</v1:RemoteSite>
      </v1:SignatureHeader>
   </soapenv:Header>
   <soapenv:Body>
      <v1:GetChildren>
         <v1:pageLink>
            <v1:ID>?</v1:ID>
            <v1:WorkID>?</v1:WorkID>
            <!--Optional:-->
            <v1:RemoteSite>?</v1:RemoteSite>
            <v1:LoadRawPageData>?</v1:LoadRawPageData>
         </v1:pageLink>
      </v1:GetChildren>
   </soapenv:Body>
</soapenv:Envelope>